Autodesk.Revit.DB.DGNImportOptions.DGNModelViewName
The model view name to be imported.
Need user give a model view name to specify which model view need to be imported into Revit
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.DGNImportOptions.IgnoreUnsupportedElementWarning
If true, ignore warning messages about unsupported elements in the DGN file.
If false, the import process is aborted if imported dgn files have unsupported elements.
Since:
2013

Autodesk.Revit.DB.DGNImportOptions.#ctor(Autodesk.Revit.DB.DGNImportOptions)
Constructs a new instance of DGNImportOptions as a copy of the import options.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.DGNImportOptions.#ctor
Constructs a new instance of DGNImportOptions with default values of all properties.
Since:
2013

Autodesk.Revit.DB.DGNImportOptions
The import options used to import DGN format files.
Since:
2013